src/go/go-patterns/decorator.org
#+TITLE: 修饰器
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/main.css" />
#+HTML_LINK_UP: code_generation.html   
#+HTML_LINK_HOME: go-patterns.html
#+OPTIONS: num:nil timestamp:nil ^:nil

#+begin_example
  修饰器模式很容易的可以把一些函数装配到另外一些函数上，可以让代码更为的简单

  也可以让一些“小功能型”的代码复用性更高，让代码中的函数可以像乐高玩具那样自由地拼装
#+end_example

Go语言的修饰器编程模式，其实也就是函数式编程的模式

#+begin_example
  不过，要提醒注意的是，Go 语言的“糖”不多，而且又是强类型的静态无虚拟机的语言，所以，无法做到像 Java 和 Python 那样的优雅的修饰器的代码
#+end_example
* 简单示例
  先来看一个示例：

  #+begin_src go 
  package main

  import "fmt"

  func decorator(f func(s string)) func(s string) {

	  return func(s string) {
		  fmt.Println("Started")
		  f(s)
		  fmt.Println("Done")
	  }
  }

  func Hello(s string) {
	  fmt.Println(s)
  }

  func main() {
	  decorator(Hello)("Hello, World!")
  }
  #+end_src

  这里使用了一个高阶函数 _decorator_ ()：
  1. 在调用的时候，先把 Hello() 函数传进去
  2. 其返回一个匿名函数，这个匿名函数中除了运行了自己的代码，也调用了被传入的 Hello() 函数

  #+begin_example
  这个玩法和 Python 的异曲同工，只不过，有些遗憾的是，Go 并不支持像 Python 那样的 @decorator 语法糖。所以，在调用上有些难看
  #+end_example
  当然，如果要想让代码容易读一些，可以这样：

  #+begin_src go 
  hello := decorator(Hello)
  hello("Hello")
  #+end_src

  再来看一个和计算运行时间的例子：

  #+begin_src go 
  package main

  import (
	  "fmt"
	  "reflect"
	  "runtime"
	  "time"
  )

  type SumFunc func(int64, int64) int64

  func getFunctionName(i interface{}) string {
	  return runtime.FuncForPC(reflect.ValueOf(i).Pointer()).Name()
  }

  func timedSumFunc(f SumFunc) SumFunc {
	  return func(start, end int64) int64 {

		  defer func(t time.Time) {
			  fmt.Printf("--- Time Elapsed (%s): %v ---\n", 
				  getFunctionName(f), time.Since(t))
		  }(time.Now())

		  return f(start, end)
	  }
  }

  func Sum1(start, end int64) int64 {
	  var sum int64
	  sum = 0
	  if start > end {
		  start, end = end, start
	  }
	  for i := start; i <= end; i++ {
		  sum += i
	  }
	  return sum
  }

  func Sum2(start, end int64) int64 {
	  if start > end {
		  start, end = end, start
	  }
	  return (end - start + 1) * (end + start) / 2
  }

  func main() {

	  sum1 := timedSumFunc(Sum1)
	  sum2 := timedSumFunc(Sum2)

	  fmt.Printf("%d, %d\n", sum1(-10000, 10000000), sum2(-10000, 10000000))
  }
  #+end_src

  关于上面的代码，有几个事说明一下：
  1. 有两个 Sum 函数
     + Sum1() 函数就是简单的做个循环
     + Sum2() 函数动用了数据公式。（注意：start 和 end 有可能有负数的情况）
  2. 代码中使用了 Go 语言的反射机器来获取函数名
  3. 修饰器函数是 timedSumFunc()

  运行后输出：
  #+begin_src sh 
  $ go run calc-time.go 
  --- Time Elapsed (main.Sum1): 2.790099ms ---
  --- Time Elapsed (main.Sum2): 231ns ---
  49999954995000, 49999954995000
  #+end_src
