html/go/go-patterns/decorator.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>修饰器</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="code_generation.html"> UP </a>
 |
 <a accesskey="H" href="go-patterns.html"> HOME </a>
</div><div id="content">
<h1 class="title">修饰器</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcdb4fa3">简单示例</a></li>
<li><a href="#org8c12b09">HTTP</a></li>
<li><a href="#orgdb78844">多个修饰器的 Pipeline</a></li>
<li><a href="#orgef4de52">泛型的修饰器</a></li>
</ul>
</div>
</div>
<pre class="example">
修饰器模式很容易的可以把一些函数装配到另外一些函数上，可以让代码更为的简单

也可以让一些“小功能型”的代码复用性更高，让代码中的函数可以像乐高玩具那样自由地拼装
</pre>

<p>
Go语言的修饰器编程模式，其实也就是函数式编程的模式
</p>

<pre class="example">
不过，要提醒注意的是，Go 语言的“糖”不多，而且又是强类型的静态无虚拟机的语言，所以，无法做到像 Java 和 Python 那样的优雅的修饰器的代码
</pre>
<div id="outline-container-orgcdb4fa3" class="outline-2">
<h2 id="orgcdb4fa3">简单示例</h2>
<div class="outline-text-2" id="text-orgcdb4fa3">
<p>
先来看一个示例：
</p>

<div class="org-src-container">
<pre class="src src-go"><span style="color: #00bfff; font-weight: bold;">package</span> main

<span style="color: #00bfff; font-weight: bold;">import</span> <span style="color: #deb887;">"fmt"</span>

<span style="color: #00bfff; font-weight: bold;">func</span> <span style="color: #daa520; font-weight: bold;">decorator</span>(<span style="color: #4eee94;">f</span> <span style="color: #00bfff; font-weight: bold;">func</span>(<span style="color: #4eee94;">s</span> <span style="color: #98f5ff;">string</span>)) <span style="color: #00bfff; font-weight: bold;">func</span>(<span style="color: #4eee94;">s</span> <span style="color: #98f5ff;">string</span>) {

        <span style="color: #00bfff; font-weight: bold;">return</span> <span style="color: #00bfff; font-weight: bold;">func</span>(<span style="color: #4eee94;">s</span> <span style="color: #98f5ff;">string</span>) {
                fmt.<span style="color: #daa520; font-weight: bold;">Println</span>(<span style="color: #deb887;">"Started"</span>)
                <span style="color: #daa520; font-weight: bold;">f</span>(s)
                fmt.<span style="color: #daa520; font-weight: bold;">Println</span>(<span style="color: #deb887;">"Done"</span>)
        }
}

<span style="color: #00bfff; font-weight: bold;">func</span> <span style="color: #daa520; font-weight: bold;">Hello</span>(<span style="color: #4eee94;">s</span> <span style="color: #98f5ff;">string</span>) {
        fmt.<span style="color: #daa520; font-weight: bold;">Println</span>(s)
}

<span style="color: #00bfff; font-weight: bold;">func</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
        <span style="color: #daa520; font-weight: bold;">decorator</span>(Hello)(<span style="color: #deb887;">"Hello, World!"</span>)
}
</pre>
</div>

<p>
这里使用了一个高阶函数 <span class="underline">decorator</span> ()：
</p>
<ol class="org-ol">
<li>在调用的时候，先把 Hello() 函数传进去</li>
<li>其返回一个匿名函数，这个匿名函数中除了运行了自己的代码，也调用了被传入的 Hello() 函数</li>
</ol>

<pre class="example">
这个玩法和 Python 的异曲同工，只不过，有些遗憾的是，Go 并不支持像 Python 那样的 @decorator 语法糖。所以，在调用上有些难看
</pre>
<p>
当然，如果要想让代码容易读一些，可以这样：
</p>

<div class="org-src-container">
<pre class="src src-go"><span style="color: #4eee94;">hello</span> := <span style="color: #daa520; font-weight: bold;">decorator</span>(Hello)
<span style="color: #daa520; font-weight: bold;">hello</span>(<span style="color: #deb887;">"Hello"</span>)
</pre>
</div>

<p>
再来看一个和计算运行时间的例子：
</p>

<div class="org-src-container">
<pre class="src src-go"><span style="color: #00bfff; font-weight: bold;">package</span> main

<span style="color: #00bfff; font-weight: bold;">import</span> (
        <span style="color: #deb887;">"fmt"</span>
        <span style="color: #deb887;">"reflect"</span>
        <span style="color: #deb887;">"runtime"</span>
        <span style="color: #deb887;">"time"</span>
)

<span style="color: #00bfff; font-weight: bold;">type</span> <span style="color: #98f5ff;">SumFunc</span> <span style="color: #00bfff; font-weight: bold;">func</span>(<span style="color: #98f5ff;">int64</span>, <span style="color: #98f5ff;">int64</span>) <span style="color: #98f5ff;">int64</span>

<span style="color: #00bfff; font-weight: bold;">func</span> <span style="color: #daa520; font-weight: bold;">getFunctionName</span>(<span style="color: #4eee94;">i</span> <span style="color: #00bfff; font-weight: bold;">interface</span>{}) <span style="color: #98f5ff;">string</span> {
        <span style="color: #00bfff; font-weight: bold;">return</span> runtime.<span style="color: #daa520; font-weight: bold;">FuncForPC</span>(reflect.<span style="color: #daa520; font-weight: bold;">ValueOf</span>(i).<span style="color: #daa520; font-weight: bold;">Pointer</span>()).<span style="color: #daa520; font-weight: bold;">Name</span>()
}

<span style="color: #00bfff; font-weight: bold;">func</span> <span style="color: #daa520; font-weight: bold;">timedSumFunc</span>(<span style="color: #4eee94;">f</span> <span style="color: #98f5ff;">SumFunc</span>) <span style="color: #98f5ff;">SumFunc</span> {
        <span style="color: #00bfff; font-weight: bold;">return</span> <span style="color: #00bfff; font-weight: bold;">func</span>(<span style="color: #4eee94;">start</span>, <span style="color: #4eee94;">end</span> <span style="color: #98f5ff;">int64</span>) <span style="color: #98f5ff;">int64</span> {

                <span style="color: #00bfff; font-weight: bold;">defer</span> <span style="color: #00bfff; font-weight: bold;">func</span>(<span style="color: #4eee94;">t</span> <span style="color: #98f5ff;">time.Time</span>) {
                        fmt.<span style="color: #daa520; font-weight: bold;">Printf</span>(<span style="color: #deb887;">"--- Time Elapsed (%s): %v ---\n"</span>, 
                                <span style="color: #daa520; font-weight: bold;">getFunctionName</span>(f), time.<span style="color: #daa520; font-weight: bold;">Since</span>(t))
                }(time.<span style="color: #daa520; font-weight: bold;">Now</span>())

                <span style="color: #00bfff; font-weight: bold;">return</span> <span style="color: #daa520; font-weight: bold;">f</span>(start, end)
        }
}

<span style="color: #00bfff; font-weight: bold;">func</span> <span style="color: #daa520; font-weight: bold;">Sum1</span>(<span style="color: #4eee94;">start</span>, <span style="color: #4eee94;">end</span> <span style="color: #98f5ff;">int64</span>) <span style="color: #98f5ff;">int64</span> {
        <span style="color: #00bfff; font-weight: bold;">var</span> <span style="color: #4eee94;">sum</span> <span style="color: #98f5ff;">int64</span>
        sum = 0
        <span style="color: #00bfff; font-weight: bold;">if</span> start &gt; end {
                start, end = end, start
        }
        <span style="color: #00bfff; font-weight: bold;">for</span> <span style="color: #4eee94;">i</span> := start; i &lt;= end; i++ {
                sum += i
        }
        <span style="color: #00bfff; font-weight: bold;">return</span> sum
}

<span style="color: #00bfff; font-weight: bold;">func</span> <span style="color: #daa520; font-weight: bold;">Sum2</span>(<span style="color: #4eee94;">start</span>, <span style="color: #4eee94;">end</span> <span style="color: #98f5ff;">int64</span>) <span style="color: #98f5ff;">int64</span> {
        <span style="color: #00bfff; font-weight: bold;">if</span> start &gt; end {
                start, end = end, start
        }
        <span style="color: #00bfff; font-weight: bold;">return</span> (end - start + 1) * (end + start) / 2
}

<span style="color: #00bfff; font-weight: bold;">func</span> <span style="color: #daa520; font-weight: bold;">main</span>() {

        <span style="color: #4eee94;">sum1</span> := <span style="color: #daa520; font-weight: bold;">timedSumFunc</span>(Sum1)
        <span style="color: #4eee94;">sum2</span> := <span style="color: #daa520; font-weight: bold;">timedSumFunc</span>(Sum2)

        fmt.<span style="color: #daa520; font-weight: bold;">Printf</span>(<span style="color: #deb887;">"%d, %d\n"</span>, <span style="color: #daa520; font-weight: bold;">sum1</span>(-10000, 10000000), <span style="color: #daa520; font-weight: bold;">sum2</span>(-10000, 10000000))
}
</pre>
</div>

<p>
关于上面的代码，有几个事说明一下：
</p>
<ol class="org-ol">
<li>有两个 Sum 函数
<ul class="org-ul">
<li>Sum1() 函数就是简单的做个循环</li>
<li>Sum2() 函数动用了数据公式。（注意：start 和 end 有可能有负数的情况）</li>
</ul></li>
<li>代码中使用了 Go 语言的反射机器来获取函数名</li>
<li>修饰器函数是 timedSumFunc()</li>
</ol>

<p>
运行后输出：
</p>
<div class="org-src-container">
<pre class="src src-sh">$ go run calc-time.go 
--- Time Elapsed (main.Sum1): 2.790099ms ---
--- Time Elapsed (main.Sum2): 231ns ---
49999954995000, 49999954995000
</pre>
</div>
</div>
</div>
