html/go/go-patterns/decorator.html
<div id="outline-container-org8c12b09" class="outline-2">
<h2 id="org8c12b09">HTTP</h2>
<div class="outline-text-2" id="text-org8c12b09">
<p>
先看一个简单的 HTTP Server 的代码：
</p>

<div class="org-src-container">
<pre class="src src-go"><span style="color: #00bfff; font-weight: bold;">package</span> main

<span style="color: #00bfff; font-weight: bold;">import</span> (
        <span style="color: #deb887;">"fmt"</span>
        <span style="color: #deb887;">"log"</span>
        <span style="color: #deb887;">"net/http"</span>
        <span style="color: #deb887;">"strings"</span>
)

<span style="color: #00bfff; font-weight: bold;">func</span> <span style="color: #daa520; font-weight: bold;">WithServerHeader</span>(<span style="color: #4eee94;">h</span> <span style="color: #98f5ff;">http.HandlerFunc</span>) <span style="color: #98f5ff;">http.HandlerFunc</span> {
        <span style="color: #00bfff; font-weight: bold;">return</span> <span style="color: #00bfff; font-weight: bold;">func</span>(<span style="color: #4eee94;">w</span> <span style="color: #98f5ff;">http.ResponseWriter</span>, <span style="color: #4eee94;">r</span> *<span style="color: #98f5ff;">http.Request</span>) {
                log.<span style="color: #daa520; font-weight: bold;">Println</span>(<span style="color: #deb887;">"---&gt;WithServerHeader()"</span>)
                w.<span style="color: #daa520; font-weight: bold;">Header</span>().<span style="color: #daa520; font-weight: bold;">Set</span>(<span style="color: #deb887;">"Server"</span>, <span style="color: #deb887;">"HelloServer v0.0.1"</span>)
                <span style="color: #daa520; font-weight: bold;">h</span>(w, r)
        }
}

<span style="color: #00bfff; font-weight: bold;">func</span> <span style="color: #daa520; font-weight: bold;">hello</span>(<span style="color: #4eee94;">w</span> <span style="color: #98f5ff;">http.ResponseWriter</span>, <span style="color: #4eee94;">r</span> *<span style="color: #98f5ff;">http.Request</span>) {
        log.<span style="color: #daa520; font-weight: bold;">Printf</span>(<span style="color: #deb887;">"Recieved Request %s from %s\n"</span>, r.URL.Path, r.RemoteAddr)
        fmt.<span style="color: #daa520; font-weight: bold;">Fprintf</span>(w, <span style="color: #deb887;">"Hello, World! "</span>+r.URL.Path)
}

<span style="color: #00bfff; font-weight: bold;">func</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
        http.<span style="color: #daa520; font-weight: bold;">HandleFunc</span>(<span style="color: #deb887;">"/v1/hello"</span>, <span style="color: #daa520; font-weight: bold;">WithServerHeader</span>(hello))
        <span style="color: #4eee94;">err</span> := http.<span style="color: #daa520; font-weight: bold;">ListenAndServe</span>(<span style="color: #deb887;">":8080"</span>, <span style="color: #ffd700;">nil</span>)
        <span style="color: #00bfff; font-weight: bold;">if</span> err != <span style="color: #ffd700;">nil</span> {
                log.<span style="color: #daa520; font-weight: bold;">Fatal</span>(<span style="color: #deb887;">"ListenAndServe: "</span>, err)
        }
}
</pre>
</div>

<pre class="example">
上面的例子还是比较简单，用 WithServerHeader() 就可以加入一个 Response 的 Header。

WithServerHeader() 函数就是一个 Decorator，其传入一个 http.HandlerFunc，然后返回一个改写的版本
</pre>

<p>
这样的函数还可以写出好些个。如下所示，有写 HTTP 响应头的，有写认证 Cookie 的，有检查认证Cookie的，有打日志的：
</p>

<div class="org-src-container">
<pre class="src src-go"><span style="color: #00bfff; font-weight: bold;">package</span> main

<span style="color: #00bfff; font-weight: bold;">import</span> (
        <span style="color: #deb887;">"fmt"</span>
        <span style="color: #deb887;">"log"</span>
        <span style="color: #deb887;">"net/http"</span>
        <span style="color: #deb887;">"strings"</span>
)

<span style="color: #00bfff; font-weight: bold;">func</span> <span style="color: #daa520; font-weight: bold;">WithServerHeader</span>(<span style="color: #4eee94;">h</span> <span style="color: #98f5ff;">http.HandlerFunc</span>) <span style="color: #98f5ff;">http.HandlerFunc</span> {
        <span style="color: #00bfff; font-weight: bold;">return</span> <span style="color: #00bfff; font-weight: bold;">func</span>(<span style="color: #4eee94;">w</span> <span style="color: #98f5ff;">http.ResponseWriter</span>, <span style="color: #4eee94;">r</span> *<span style="color: #98f5ff;">http.Request</span>) {
                log.<span style="color: #daa520; font-weight: bold;">Println</span>(<span style="color: #deb887;">"---&gt;WithServerHeader()"</span>)
                w.<span style="color: #daa520; font-weight: bold;">Header</span>().<span style="color: #daa520; font-weight: bold;">Set</span>(<span style="color: #deb887;">"Server"</span>, <span style="color: #deb887;">"HelloServer v0.0.1"</span>)
                <span style="color: #daa520; font-weight: bold;">h</span>(w, r)
        }
}

<span style="color: #00bfff; font-weight: bold;">func</span> <span style="color: #daa520; font-weight: bold;">WithAuthCookie</span>(<span style="color: #4eee94;">h</span> <span style="color: #98f5ff;">http.HandlerFunc</span>) <span style="color: #98f5ff;">http.HandlerFunc</span> {
        <span style="color: #00bfff; font-weight: bold;">return</span> <span style="color: #00bfff; font-weight: bold;">func</span>(<span style="color: #4eee94;">w</span> <span style="color: #98f5ff;">http.ResponseWriter</span>, <span style="color: #4eee94;">r</span> *<span style="color: #98f5ff;">http.Request</span>) {
                log.<span style="color: #daa520; font-weight: bold;">Println</span>(<span style="color: #deb887;">"---&gt;WithAuthCookie()"</span>)
                <span style="color: #4eee94;">cookie</span> := &amp;<span style="color: #98f5ff;">http.Cookie</span>{<span style="color: #ffd700;">Name</span>: <span style="color: #deb887;">"Auth"</span>, <span style="color: #ffd700;">Value</span>: <span style="color: #deb887;">"Pass"</span>, <span style="color: #ffd700;">Path</span>: <span style="color: #deb887;">"/"</span>}
                http.<span style="color: #daa520; font-weight: bold;">SetCookie</span>(w, cookie)
                <span style="color: #daa520; font-weight: bold;">h</span>(w, r)
        }
}

<span style="color: #00bfff; font-weight: bold;">func</span> <span style="color: #daa520; font-weight: bold;">WithBasicAuth</span>(<span style="color: #4eee94;">h</span> <span style="color: #98f5ff;">http.HandlerFunc</span>) <span style="color: #98f5ff;">http.HandlerFunc</span> {
        <span style="color: #00bfff; font-weight: bold;">return</span> <span style="color: #00bfff; font-weight: bold;">func</span>(<span style="color: #4eee94;">w</span> <span style="color: #98f5ff;">http.ResponseWriter</span>, <span style="color: #4eee94;">r</span> *<span style="color: #98f5ff;">http.Request</span>) {
                log.<span style="color: #daa520; font-weight: bold;">Println</span>(<span style="color: #deb887;">"---&gt;WithBasicAuth()"</span>)
                <span style="color: #4eee94;">cookie</span>, <span style="color: #4eee94;">err</span> := r.<span style="color: #daa520; font-weight: bold;">Cookie</span>(<span style="color: #deb887;">"Auth"</span>)
                <span style="color: #00bfff; font-weight: bold;">if</span> err != <span style="color: #ffd700;">nil</span> || cookie.Value != <span style="color: #deb887;">"Pass"</span> {
                        w.<span style="color: #daa520; font-weight: bold;">WriteHeader</span>(http.StatusForbidden)
                        <span style="color: #00bfff; font-weight: bold;">return</span>
                }
                <span style="color: #daa520; font-weight: bold;">h</span>(w, r)
        }
}

<span style="color: #00bfff; font-weight: bold;">func</span> <span style="color: #daa520; font-weight: bold;">WithDebugLog</span>(<span style="color: #4eee94;">h</span> <span style="color: #98f5ff;">http.HandlerFunc</span>) <span style="color: #98f5ff;">http.HandlerFunc</span> {
        <span style="color: #00bfff; font-weight: bold;">return</span> <span style="color: #00bfff; font-weight: bold;">func</span>(<span style="color: #4eee94;">w</span> <span style="color: #98f5ff;">http.ResponseWriter</span>, <span style="color: #4eee94;">r</span> *<span style="color: #98f5ff;">http.Request</span>) {
                log.<span style="color: #daa520; font-weight: bold;">Println</span>(<span style="color: #deb887;">"---&gt;WithDebugLog"</span>)
                r.<span style="color: #daa520; font-weight: bold;">ParseForm</span>()
                log.<span style="color: #daa520; font-weight: bold;">Println</span>(r.Form)
                log.<span style="color: #daa520; font-weight: bold;">Println</span>(<span style="color: #deb887;">"path"</span>, r.URL.Path)
                log.<span style="color: #daa520; font-weight: bold;">Println</span>(<span style="color: #deb887;">"scheme"</span>, r.URL.Scheme)
                log.<span style="color: #daa520; font-weight: bold;">Println</span>(r.Form[<span style="color: #deb887;">"url_long"</span>])
                <span style="color: #00bfff; font-weight: bold;">for</span> <span style="color: #4eee94;">k</span>, <span style="color: #4eee94;">v</span> := <span style="color: #00bfff; font-weight: bold;">range</span> r.Form {
                        log.<span style="color: #daa520; font-weight: bold;">Println</span>(<span style="color: #deb887;">"key:"</span>, k)
                        log.<span style="color: #daa520; font-weight: bold;">Println</span>(<span style="color: #deb887;">"val:"</span>, strings.<span style="color: #daa520; font-weight: bold;">Join</span>(v, <span style="color: #deb887;">""</span>))
                }
                <span style="color: #daa520; font-weight: bold;">h</span>(w, r)
        }
}
<span style="color: #00bfff; font-weight: bold;">func</span> <span style="color: #daa520; font-weight: bold;">hello</span>(<span style="color: #4eee94;">w</span> <span style="color: #98f5ff;">http.ResponseWriter</span>, <span style="color: #4eee94;">r</span> *<span style="color: #98f5ff;">http.Request</span>) {
        log.<span style="color: #daa520; font-weight: bold;">Printf</span>(<span style="color: #deb887;">"Recieved Request %s from %s\n"</span>, r.URL.Path, r.RemoteAddr)
        fmt.<span style="color: #daa520; font-weight: bold;">Fprintf</span>(w, <span style="color: #deb887;">"Hello, World! "</span>+r.URL.Path)
}

<span style="color: #00bfff; font-weight: bold;">func</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
        http.<span style="color: #daa520; font-weight: bold;">HandleFunc</span>(<span style="color: #deb887;">"/v1/hello"</span>, <span style="color: #daa520; font-weight: bold;">WithServerHeader</span>(<span style="color: #daa520; font-weight: bold;">WithAuthCookie</span>(hello)))
        http.<span style="color: #daa520; font-weight: bold;">HandleFunc</span>(<span style="color: #deb887;">"/v2/hello"</span>, <span style="color: #daa520; font-weight: bold;">WithServerHeader</span>(<span style="color: #daa520; font-weight: bold;">WithBasicAuth</span>(hello)))
        http.<span style="color: #daa520; font-weight: bold;">HandleFunc</span>(<span style="color: #deb887;">"/v3/hello"</span>, <span style="color: #daa520; font-weight: bold;">WithServerHeader</span>(<span style="color: #daa520; font-weight: bold;">WithBasicAuth</span>(<span style="color: #daa520; font-weight: bold;">WithDebugLog</span>(hello))))
        <span style="color: #4eee94;">err</span> := http.<span style="color: #daa520; font-weight: bold;">ListenAndServe</span>(<span style="color: #deb887;">":8080"</span>, <span style="color: #ffd700;">nil</span>)
        <span style="color: #00bfff; font-weight: bold;">if</span> err != <span style="color: #ffd700;">nil</span> {
                log.<span style="color: #daa520; font-weight: bold;">Fatal</span>(<span style="color: #deb887;">"ListenAndServe: "</span>, err)
        }
}
</pre>
</div>
</div>
</div>
